/**
 * 
 * 脚手架是开发中经常会使用的工具，比如vue-cli、create-react-app等，这些脚手架可以通过简单的命令，快速去搭建项目，让我们更专注于项目的开发

随着项目的增多、人员的扩展，大家开发的基础组件和公共方法也越来越多，希望把这些积累添加到脚手架中，当成项目模板留存下来

这样再创建项目时，就不用每次去其他项目中来回 copy

手写一个 mini 版的脚手架
下面我们一起，手写一个 mini 版的脚手架

通过这个案例来了解脚手架的工作流程，以及使用了哪些常用工具

新建文件夹my-build-cli，执行npm init -y
 */

// https://github.com/xy-sea/blog/blob/main/markdown/%E3%80%8C%E5%8E%86%E6%97%B68%E4%B8%AA%E6%9C%88%E3%80%8D10%E4%B8%87%E5%AD%97%E5%89%8D%E7%AB%AF%E7%9F%A5%E8%AF%86%E4%BD%93%E7%B3%BB%E6%80%BB%E7%BB%93%EF%BC%88%E5%B7%A5%E7%A8%8B%E5%8C%96%E7%AF%87%EF%BC%89.md